nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/seq_w_nvme0n1_4iodepth/4096.txt
write: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=4
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=5852: Mon Jul 17 16:20:37 2023
  write: IOPS=609, BW=2439MiB/s (2558MB/s)(47.7GiB/20005msec)
    slat (usec): min=111, max=450, avg=234.11, stdev=60.22
    clat (usec): min=1051, max=20568, avg=6321.95, stdev=1939.46
     lat (usec): min=1244, max=20852, avg=6556.33, stdev=1937.23
    clat percentiles (usec):
     |  1.00th=[ 2278],  5.00th=[ 3523], 10.00th=[ 4621], 20.00th=[ 5669],
     | 30.00th=[ 5866], 40.00th=[ 5997], 50.00th=[ 6128], 60.00th=[ 6259],
     | 70.00th=[ 6390], 80.00th=[ 6587], 90.00th=[ 7570], 95.00th=[10290],
     | 99.00th=[14091], 99.50th=[15533], 99.90th=[19006], 99.95th=[19268],
     | 99.99th=[20579]
   bw (  MiB/s): min= 2384, max= 2512, per=100.00%, avg=2439.40, stdev=37.93, samples=40
   iops        : min=  596, max=  628, avg=609.85, stdev= 9.48, samples=40
  lat (msec)   : 2=0.20%, 4=7.32%, 10=86.95%, 20=5.51%, 50=0.02%
  cpu          : usr=7.38%, sys=7.43%, ctx=12011, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,12200,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=2439MiB/s (2558MB/s), 2439MiB/s-2439MiB/s (2558MB/s-2558MB/s), io=47.7GiB (51.2GB), run=20005-20005msec

Disk stats (read/write):
  nvme0n1: ios=43/388260, merge=0/0, ticks=2/2165319, in_queue=2146625, util=99.57%