nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/seq_w_nvme0n1_4iodepth/8192.txt
write: (g=0): rw=write, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=4
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=5891: Mon Jul 17 16:20:58 2023
  write: IOPS=305, BW=2441MiB/s (2560MB/s)(47.7GiB/20009msec)
    slat (usec): min=350, max=1406, avg=675.44, stdev=101.96
    clat (usec): min=1570, max=27746, avg=12427.83, stdev=2210.27
     lat (usec): min=1969, max=28430, avg=13103.51, stdev=2205.62
    clat percentiles (usec):
     |  1.00th=[ 6980],  5.00th=[ 9241], 10.00th=[11076], 20.00th=[11600],
     | 30.00th=[11731], 40.00th=[11994], 50.00th=[12125], 60.00th=[12256],
     | 70.00th=[12518], 80.00th=[12911], 90.00th=[14877], 95.00th=[16909],
     | 99.00th=[20579], 99.50th=[22152], 99.90th=[24511], 99.95th=[25297],
     | 99.99th=[27657]
   bw (  MiB/s): min= 2368, max= 2496, per=99.98%, avg=2440.80, stdev=40.18, samples=40
   iops        : min=  296, max=  312, avg=305.10, stdev= 5.02, samples=40
  lat (msec)   : 2=0.02%, 4=0.03%, 10=6.81%, 20=91.78%, 50=1.36%
  cpu          : usr=15.82%, sys=5.07%, ctx=6087, majf=0, minf=2149
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6106,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=2441MiB/s (2560MB/s), 2441MiB/s-2441MiB/s (2560MB/s-2560MB/s), io=47.7GiB (51.2GB), run=20009-20009msec

Disk stats (read/write):
  nvme0n1: ios=43/388195, merge=0/0, ticks=2/4191174, in_queue=4173554, util=99.50%